//1.Задача-1
//Напишіть функцію яка приймає два параметри str1 та str2.
// Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює останій літері str2.
// В іншому випадку функція повинна повернути булеве значення false.

// function checkLetters(str1, str2) {
//   if (str1[0] === str2(str2.lendth - 1)) {
//     console.log(true);
//   } else {
//     console.log(false);
//   }
//   checkLetters(may, muyhjhjh);
// }

// Задача-2
// Напишіть функцію яка приймає два параметри str1 та str2.
// Функція повинна повернути булеве значення true якщо перша літера str1 дорівнює першій літері str2.
// В іншому випадку функція повинна повернути булеве значення false.

// Функція calculateTotal(number) приймає ціле число(параметр number).
// Доповни код функції так, щоб вона повертала суму всіх цілих чисел
// від одиниці до цього числа включно.Наприклад, якщо number дорівнює 3,
//     то сума - це 1 + 2 + 3, тобто 6.
